Repository: hexchan/hexchan-engine
Catalog: src/imageboard/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Imageboard
ru: Имиджборд

source: Board not found
ru: Доска не найдена

source: Board is locked
ru: Доска заблокирована

source: Thread not found
ru: Тред не найден

source: Thread is locked
ru: Тред заблокирован

source: Bad message content: {reason}
ru: Некорректное содержимое: {reason}

source: Parameter "{name}" is missing or has wrong value
ru: Параметр "{name}" отсутствует или имеет некорректное значение

source: Request should have POST type
ru: Тип запроса должен быть POST

source: Form is invalid
ru: Форма заполнена некорректно

source: Post limit was reached
ru: Достигнут лимит постов в треде

source: Message should not be empty, either write some text or attach an image
ru: Сообщение не должно быть пустым, добавьте текст сообщения и/или изображения

source: Too many files attached, up to {max_files} file(s) are allowed
ru: Прикреплено слишком много изображений, разрешено добавить до {max_files} файлов

source: Attached file size is too large, sizes up to {file_size} are allowed
ru: Прикреплен слишком большой файл, разрешены файлы размером до {file_size}

source: Attached file has an unsupported type, only types {types} are supported
ru: Прикрепленный файл имеет неверный тип, поддерживаемые типы: {types}

source: You have to wait for about {timeout} seconds to post again.
ru: Вам необходимо подождать около {timeout} секунд чтобы отправить новое сообщение.

source: Captcha
ru: Капча

# posting form
source: Images
ru: Картинки

source: You were banned
ru: Пользователь забанен

source: Incorrect form type
ru: Некорректный тип формы

source: Captcha is invalid
ru: Некорректная каптча

source: Captcha has expired
ru: Каптча истекла

source: Text rejected
ru: Текст отклонен

source: Image rejected
ru: Изображение отклонено

source: You have to wait for about %(timeout)s seconds to post again.
ru: Вам необходимо подождать около %(timeout)s секунд чтобы отправить новое сообщение.

source: Too many files attached, up to %(max_files)s file(s) are allowed
ru: Прикреплено слишком много изображений, разрешено добавить до %(max_files)s файлов

source: Attached file size is too large, sizes up to %(file_size)s are allowed
ru: Прикреплен слишком большой файл, разрешены файлы размером до %(file_size)s

source: Attached file has an unsupported type, only types %(types)s are supported
ru: Прикрепленный файл имеет неверный тип, поддерживаемые типы: %(types)s

source: Thread ID is not specified when creating a new post
ru: Не указан ID треда при создании поста

source: Name
ru: Название

source: Description
ru: Описание

source: Short board description
ru: Краткое описание доски

source: Rules
ru: Правила

source: Board rules will be displayed next to posting form.
ru: Правила доски будут показаны рядом с формой поста.

source: Custom style
ru: Дополнительный стиль

source: Custom CSS that would be applied only on this board's pages
ru: Дополнительные правила CSS, которые будет применены только к этой доске

source: Default username
ru: Имя пользователя по умолчанию

source: Default username will be saved, if post's author field was empty.
ru: Имя по умолчанию будет сохранено, если поле "автор" не было заполнено.

source: Default maximum posts number
ru: Максимальное число постов по умолчанию

source: Maximum number of posts for new threads by default. Can be overridden in thread's properties.
ru: Максимальное число постов в новых тредах по умолчанию. Может быть переопределено в свойствах треда.

source: Posts per thread per page
ru: Число постов в треде на странице

source: Number of thread's posts visible on board's pages, not counting OP post.
ru: Число постов в тредах на странице доски, не считая ОП.

source: Threads per page
ru: Тредов на странице

source: Number of threads on board's page
ru: Число тредов на одной странице доски

source: Maximum threads number
ru: Максимальное число тредов

source: Maximum number of threads on this boards. When reaching this level older threads will be deleted.
ru: Максимальное число тредов на доске. При достижении максимума более старые треды будут удалены.

source: Is hidden
ru: Скрыто

source: Is this board hidden from boards list. Can still be accessed by direct URL.
ru: Эта доска скрыта из списка. Она все еще доступна по прямой ссылке.

source: Is locked
ru: Заблокировано

source: New posts and threads can't be created on locked board.
ru: Новые посты и треды не могут быть созданы на заблокированной доске.

source: Is deleted
ru: Удалено

source: Boards is removed from boards list and can't be accessed by direct URL.
ru: Доска удалена из списка и недоступна по прямой ссылке.

source: Last post HID
ru: Последний HID поста

source: Created at
ru: Дата создания

source: Updated at
ru: Дата обновления

source: Board
ru: Доска

source: Boards
ru: Доски

source: Post
ru: Пост

source: Image
ru: Изображение

source: Original name
ru: Имя файла

source: MIME type
ru: MIME-тип

source: Size
ru: Размер

source: Width
ru: Ширина

source: Height
ru: Высота

source: Is spoiler
ru: Спойлер

source: Checksum
ru: Контрольная сумма

source: Thumb
ru: Превью

source: Thumb width
ru: Ширина превью

source: Thumb height
ru: Высота превью

source: Images
ru: Изображения

source: Thread
ru: Тред

source: Text
ru: Текст

source: Title
ru: Тема

source: Author
ru: Автор

source: Password
ru: Пароль

source: Is OP
ru: ОП

source: User was warned
ru: Пользователь предупрежден

source: User was banned
ru: Пользователь забанен

source: Created by
ru: Создано пользователем

source: Refs
ru: Ссылки

source: IP address
ru: IP-адрес

source: Session ID
ru: ID сессии

source: Posts
ru: Посты

source: OP
ru: ОП

source: Is sticky
ru: Закреплено

source: Maximum posts number
ru: Максимальное число постов

source: Threads
ru: Треды

source: Bad request
ru: Некорректный запрос

source: Forbidden
ru: Ошибка доступа

source: Page not found
ru: Страница не найдена

source: Path
ru: Путь

source: Server error
ru: Ошибка сервера

source: Page generated at
ru: Страница сгенерирована

# board
source: updated at
ru: обновлена

source: Board page
ru: Страница доски

source: Thread catalog
ru: Каталог тредов

source: My thread
ru: Мой тред

source: Sticky
ru: Закреплен

source: Locked
ru: Закрыт

source: Pages
ru: Страницы

source: Select images
ru: Выбрать изображения

source: Selected
ru: Выбрано

source: Bad file format
ru: Некорректный формат файла

source: Too many images attached
ru: Прикреплено слишком много файлов

source: File is too large
ru: Файл слишком большой

source: Post is hidden.
ru: Пост скрыт.

source: Thread is hidden.
ru: Тред скрыт.

source: Show
ru: Показать

source: Close
ru: Закрыть

source: Loading image…
ru: Загрузка изображения…

source: Image loading error
ru: Ошибка загрузки изображения

source: Thread is closed for new posts
ru: Тред закрыт для новых постов

source: Board is closed for new threads and posts
ru: Доска закрыта для новых тредов и постов

source: Reply
ru: Ответ

source: Administrator
ru: Администратор

source: Favorite
ru: В закладки

source: Expand thread
ru: Развернуть тред

source: Hide thread
ru: Скрыть тред

source: Open admin panel
ru: Открыть админ-панель

source: My post
ru: Мой пост

source: Replies
ru: Ответы

source: Create a new thread
ru: Создать новый тред

source: Reply to the thread
ru: Ответить в тред

source: Submit
ru: Отправить

source: Board rules
ru: Правила доски

source: Post not found.
ru: Пост не найден.

source: Error
ru: Ошибка

# thread
source: updated at
ru: обновлен
