Repository: hexchan/hexchan-engine
Catalog: src/captcha/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Captcha
ru: Капча

source: Captcha DB is empty
ru: Таблица капчи в БД не заполнена

source: Captcha is invalid
ru: Неверно введена капча

source: Captcha has expired
ru: Срок действия капчи истек

source: Captcha not found
ru: Капча не найдена в БД

source: Public ID
ru: Публичный ID

source: Solution
ru: Решение

source: Encoded image
ru: Кодированное изображение

source: Captchas
ru: Капчи

source: Captcha code
ru: Капча

source: Click to refresh CAPTCHA
ru: Нажмите чтобы обновить каптчу
